# Decision Tree Classification

In [1]:
import pandas as pd                  # importing pandas

In [2]:
df = pd.read_csv("salaries.csv")     #reading the csv file

df.head(16)

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [3]:
inputs = df.drop('salary_more_then_100k',axis='columns')    # inputs vannale features haru vanna khojkya ho,, i.e salary_more_then_100k vanni column bayeko baki sabbai column hamro features haru ho

In [4]:
# inputs                    # just for checking how my features varibale looks like

In [5]:
target = df['salary_more_then_100k']                        # salary_more_then_100k vanni column chai hamro target ho

In [6]:
# target               # just for checking how my target varibale looks like

In [7]:
from sklearn.preprocessing import LabelEncoder   # since Machine Learning Algorithm can only works on column or label as number so for this we need labelEncoder

In [8]:
# Initializing the object from the LabelEncoder() class
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [9]:
# inputs['column_name']  yo syntax use garera we can create extra column in the dataframe
inputs['company_n'] = le_company.fit_transform(inputs['company'])          # fit_transform()  method column as parameter and Encode(transform) these column to another numeric column
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [10]:
inputs                  # just for checking how the dataframe looks like after creating 3 extra new numeric columns

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [11]:
inputs_n = inputs.drop(['company','job','degree'],axis='columns')             # dropping the columns company, job, degree

In [12]:
inputs_n             # just for checking

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [13]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [14]:
from sklearn import tree             # importing tree from sklearn

In [15]:
model = tree.DecisionTreeClassifier()        # from DecisionTreeClassifier() class instantiating the new object ( i.e model ) object

In [16]:
model.fit(inputs_n, target)      # Training the model # fitting the model by passing inputs_n as features varibale & target as target varibale

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [17]:
model.score(inputs_n,target)         # training data nai as testing ko rup ma halera score check gareko cha (i.e obviously 1 nai aai halcha)

1.0

**Is salary of Google, Computer Engineer, Bachelors degree > 100 k ?**

In [18]:
model.predict([[2,1,0]])           # making prediction by the model for Company= Goolge, degree= Bachelors degree, Job= Computer Engineer

array([0], dtype=int64)

**Is salary of Google, Computer Engineer, Masters degree > 100 k ?**

In [19]:
model.predict([[2,1,1]])        # making prediction by the model for Company= Goolge, degree= Masters Degree, Job= Computer Engineer

array([1], dtype=int64)